import classes from "@/components/format/format.module.css";
import SvgInnerText from "@/components/svg-inner-text";

export default function MainTour({}) {
  return (
    <>
      <Desktop />
      <Mobile />
    </>
  );
}

function Desktop() {
  const textLines = [
    "Під час основного туру перед вами поставлять",
    "реальну інженерну проблему, нададуть усі необхідні",
    "матеріали та 16 годин на її розв'язання (по 8 годин у",
    "перший та другий день). За цей час вам потрібно",
    "спроєктувати або ж сконструювати модель",
    "власноруч, що розв’яже поставлену задачу",
    "(залежно від обраної категорії).",
  ];

  return (
    <svg
      className={classes.desktop}
      viewBox="0 0 1750 875"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
    >
      <path
        d="M1527.34 40.5075H1653.96V159.411L1747 159.411V180.841V218.256V244.084V401.421L1734.45 416.596L1703.64 453.828V777.948L1653.96 838H1570.99L1545.65 838H1229.17L1203.83 838H884.373H859.035H732.84H680L612.5 838H461.5H414H332.811L106.5 838V777.948L59.5 740L33.3065 718.5L3 692.349V567.93V337.33L33.3065 300.699V40.5074L33.3069 3L184.733 3.00006L286.915 3L331.404 40.5074L1527.34 40.5075Z"
        fill="#42019B"
        fill-opacity="0.5"
        stroke="#FFB800"
        stroke-width="5"
        stroke-miterlimit="16"
      />
      <SvgInnerText textLines={textLines} startYCoord={190} />
    </svg>
  );
}

function Mobile() {
  const textLines = [
    "Під час основного туру перед",
    "вами поставлять реальну",
    "інженерну проблему, нададуть",
    "усі необхідні матеріали та 16",
    "годин на її розв'язання (по 8",
    "годин у перший та другий",
    "день). За цей час вам потрібно",
    "спроєктувати або ж",
    "сконструювати модель",
    "власноруч, що розв’яже",
    "поставлену задачу (залежно",
    "від обраної категорії).",
  ];

  return (
    <svg
      className={classes.mobile}
      viewBox="0 0 331 390"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
    >
      <path
        d="M2.05333 320.868L2.04262 357.523L51.1004 357.521L53.4353 357.523L53.4352 383.015L105 383.015L134.976 382.887L158.725 382.906L163.494 382.91L223.613 382.958L228.381 382.962L261 383.014L281.5 352.974L316.43 352.974L316.431 256.718L329.001 219.894L329.001 189.681L329.001 121.227L329.001 103.205L329.001 45.7165L316.431 35.5714L299.024 19.9616L299.024 2.23882L270 2.23875L163.494 2.23882L60.5001 2.2389L30.5001 2.23888L8.69084 2.23886L8.69113 19.9632L2.19114 27.8993L2.13663 129.134L15.1633 142.097L15.1629 249.466L2.05332 294.454L2.05333 320.868Z"
        fill="#42019B"
        fill-opacity="0.5"
        stroke="#FFB800"
        stroke-width="4"
        stroke-miterlimit="16"
      />
      <SvgInnerText
        isMobile={true}
        textLines={textLines}
        startYCoord={40}
        startXCoord={30}
        step={27}
      />
    </svg>
  );
}
